In [51]:
import sqlite3
%load_ext sql
con = sqlite3.connect("database_prova.db")  # connessione
cur = con.cursor()  # cursore
%sql sqlite:///database_prova.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

**Creazione e riempimento di due tabelle**

Lo scopo Ã¨ quello di sperimentare alcune query e i diversi tipi di join

In [52]:
%%sql

DROP TABLE IF EXISTS persone;

CREATE TABLE persone (
    id INT PRIMARY KEY,
    nome VARCHAR(50),
    cognome VARCHAR(50),
    sesso CHAR(1),
    data_nascita DATE,
    altezza DECIMAL(4,2),
    peso DECIMAL(5,2),
    cap VARCHAR(10),
    provincia VARCHAR(50)
);

 * sqlite:///database_prova.db
Done.
Done.

[]

In [53]:
%%sql

INSERT INTO persone (id, nome, cognome, sesso, data_nascita, altezza, peso, cap, provincia) VALUES
(1, 'Luca', 'Rossi', 'M', '1985-06-15', 1.75, 70.5, '20121', 'Milano'),
(2, 'Maria', 'Bianchi', 'F', '1990-09-22', 1.68, 58.2, '00184', 'Roma'),
(3, 'Giovanni', 'Verdi', 'M', '1982-12-05', 1.80, 82.0, '10121', 'Torino'),
(4, 'Elena', 'Neri', 'F', '1995-07-10', 1.65, 55.3, '80121', 'Napoli'),
(5, 'Marco', 'Gallo', 'M', '1988-04-30', 1.78, 76.0, '50121', 'Firenze'),
(6, 'Sara', 'Moretti', 'F', '1993-11-15', 1.72, 60.0, '35121', 'Padova'),
(7, 'Alessandro', 'Romano', 'M', '1980-02-20', 1.85, 90.0, '90121', 'Palermo'),
(8, 'Francesca', 'De Luca', 'F', '1992-05-25', 1.60, 50.4, '40121', 'Bologna'),
(9, 'Giorgio', 'Fabbri', 'M', '1987-08-18', 1.77, 74.5, '15121', 'Alessandria'),
(10, 'Martina', 'Ferrari', 'F', '1996-03-05', 1.63, 57.8, '70121', 'Bari'),
(11, 'Paolo', 'Mancini', 'M', '1983-11-30', 1.82, 78.0, '60121', 'Ancona'),
(12, 'Angela', 'Serra', 'F', '1991-06-22', 1.70, 62.1, '80122', 'Napoli'),
(13, 'Fabio', 'Conti', 'M', '1984-12-10', 1.79, 79.9, '16121', 'Genova'),
(14, 'Silvia', 'Pellegrini', 'F', '1994-09-01', 1.66, 56.7, '30121', 'Venezia'),
(15, 'Davide', 'Ricci', 'M', '1986-07-07', 1.81, 80.5, '20122', 'Milano');

 * sqlite:///database_prova.db
15 rows affected.

[]

In [54]:
%%sql

DROP TABLE IF EXISTS occupazione;

CREATE TABLE occupazione (
    persona_id INT PRIMARY KEY,
    lavoro VARCHAR(100),
    stipendio DECIMAL(10,2),
    azienda VARCHAR(100),
    FOREIGN KEY (persona_id) REFERENCES persone(id)
);

 * sqlite:///database_prova.db
Done.
Done.

[]

In [55]:
%%sql

INSERT INTO occupazione (persona_id, lavoro, stipendio, azienda) VALUES
(1, 'Ingegnere', 4000.00, 'TechSolutions'),
(2, 'Insegnante', 2500.00, 'Scuola Statale'),
(3, 'Medico', 5000.00, 'Ospedale San Raffaele'),
(4, 'Architetto', 3800.00, 'Studio ArchiDesign'),
(6, 'Commercialista', 3200.00, 'Finance Group'),
(7, 'Avvocato', 4500.00, 'Studio Legale Rossi'),
(9, 'Programmatore', 3800.00, 'Software House'),
(10, 'Designer', 2900.00, 'Creative Agency'),
(12, 'Cuoco', 2700.00, 'Ristorante La Stella'),
(14, 'Giornalista', 3100.00, 'Giornale La Notizia');

 * sqlite:///database_prova.db
10 rows affected.

[]

In [56]:
# Libreria per creare tabelle
!pip install ipython-sql prettytable
import prettytable
prettytable.DEFAULT = 'DEFAULT'

Requirement already satisfied: ipython-sql in /usr/local/lib/python3.11/dist-packages (0.5.0)
Requirement already satisfied: prettytable in /usr/local/lib/python3.11/dist-packages (3.16.0)
Requirement already satisfied: ipython in /usr/local/lib/python3.11/dist-packages (from ipython-sql) (7.34.0)
Requirement already satisfied: sqlalchemy>=2.0 in /usr/local/lib/python3.11/dist-packages (from ipython-sql) (2.0.40)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.11/dist-packages (from ipython-sql) (0.5.3)
Requirement already satisfied: six in /usr/local/lib/python3.11/dist-packages (from ipython-sql) (1.17.0)
Requirement already satisfied: ipython-genutils in /usr/local/lib/python3.11/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.11/dist-packages (from prettytable) (0.2.13)
Requirement already satisfied: greenlet>=1 in /usr/local/lib/python3.11/dist-packages (from sqlalchemy>=2.0->ipython-sql) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in /usr/local/lib/python3.11/dist-packages (from sqlalchemy>=2.0->ipython-sql) (4.13.0)
Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.11/dist-packages (from ipython->ipython-sql) (75.2.0)
Requirement already satisfied: jedi>=0.16 in /usr/local/lib/python3.11/dist-packages (from ipython->ipython-sql) (0.19.2)
Requirement already satisfied: decorator in /usr/local/lib/python3.11/dist-packages (from ipython->ipython-sql) (4.4.2)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.11/dist-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.11/dist-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /usr/local/lib/python3.11/dist-packages (from ipython->ipython-sql) (3.0.50)
Requirement already satisfied: pygments in /usr/local/lib/python3.11/dist-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: backcall in /usr/local/lib/python3.11/dist-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /usr/local/lib/python3.11/dist-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: pexpect>4.3 in /usr/local/lib/python3.11/dist-packages (from ipython->ipython-sql) (4.9.0)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in /usr/local/lib/python3.11/dist-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.11/dist-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)

**Alcune query per esercizio**

In [57]:
%sql SELECT * FROM persone

 * sqlite:///database_prova.db
Done.

[(1, 'Luca', 'Rossi', 'M', '1985-06-15', 1.75, 70.5, '20121', 'Milano'),
 (2, 'Maria', 'Bianchi', 'F', '1990-09-22', 1.68, 58.2, '00184', 'Roma'),
 (3, 'Giovanni', 'Verdi', 'M', '1982-12-05', 1.8, 82, '10121', 'Torino'),
 (4, 'Elena', 'Neri', 'F', '1995-07-10', 1.65, 55.3, '80121', 'Napoli'),
 (5, 'Marco', 'Gallo', 'M', '1988-04-30', 1.78, 76, '50121', 'Firenze'),
 (6, 'Sara', 'Moretti', 'F', '1993-11-15', 1.72, 60, '35121', 'Padova'),
 (7, 'Alessandro', 'Romano', 'M', '1980-02-20', 1.85, 90, '90121', 'Palermo'),
 (8, 'Francesca', 'De Luca', 'F', '1992-05-25', 1.6, 50.4, '40121', 'Bologna'),
 (9, 'Giorgio', 'Fabbri', 'M', '1987-08-18', 1.77, 74.5, '15121', 'Alessandria'),
 (10, 'Martina', 'Ferrari', 'F', '1996-03-05', 1.63, 57.8, '70121', 'Bari'),
 (11, 'Paolo', 'Mancini', 'M', '1983-11-30', 1.82, 78, '60121', 'Ancona'),
 (12, 'Angela', 'Serra', 'F', '1991-06-22', 1.7, 62.1, '80122', 'Napoli'),
 (13, 'Fabio', 'Conti', 'M', '1984-12-10', 1.79, 79.9, '16121', 'Genova'),
 (14, 'Silvia', 'Pellegrini', 'F', '1994-09-01', 1.66, 56.7, '30121', 'Venezia'),
 (15, 'Davide', 'Ricci', 'M', '1986-07-07', 1.81, 80.5, '20122', 'Milano')]

In [58]:
# Aggiungo una colonna con l'Indice di Massa Corporea (imc): peso in kg diviso per l'altezza in m al quadrato
%%sql
ALTER TABLE persone ADD imc REAL;

UPDATE persone SET imc =  ROUND(peso / (altezza * altezza), 2);

 * sqlite:///database_prova.db
Done.
15 rows affected.

[]

In [59]:
%sql SELECT * FROM persone

 * sqlite:///database_prova.db
Done.

[(1, 'Luca', 'Rossi', 'M', '1985-06-15', 1.75, 70.5, '20121', 'Milano', 23.02),
 (2, 'Maria', 'Bianchi', 'F', '1990-09-22', 1.68, 58.2, '00184', 'Roma', 20.62),
 (3, 'Giovanni', 'Verdi', 'M', '1982-12-05', 1.8, 82, '10121', 'Torino', 25.31),
 (4, 'Elena', 'Neri', 'F', '1995-07-10', 1.65, 55.3, '80121', 'Napoli', 20.31),
 (5, 'Marco', 'Gallo', 'M', '1988-04-30', 1.78, 76, '50121', 'Firenze', 23.99),
 (6, 'Sara', 'Moretti', 'F', '1993-11-15', 1.72, 60, '35121', 'Padova', 20.28),
 (7, 'Alessandro', 'Romano', 'M', '1980-02-20', 1.85, 90, '90121', 'Palermo', 26.3),
 (8, 'Francesca', 'De Luca', 'F', '1992-05-25', 1.6, 50.4, '40121', 'Bologna', 19.69),
 (9, 'Giorgio', 'Fabbri', 'M', '1987-08-18', 1.77, 74.5, '15121', 'Alessandria', 23.78),
 (10, 'Martina', 'Ferrari', 'F', '1996-03-05', 1.63, 57.8, '70121', 'Bari', 21.75),
 (11, 'Paolo', 'Mancini', 'M', '1983-11-30', 1.82, 78, '60121', 'Ancona', 23.55),
 (12, 'Angela', 'Serra', 'F', '1991-06-22', 1.7, 62.1, '80122', 'Napoli', 21.49),
 (13, 'Fabio', 'Conti', 'M', '1984-12-10', 1.79, 79.9, '16121', 'Genova', 24.94),
 (14, 'Silvia', 'Pellegrini', 'F', '1994-09-01', 1.66, 56.7, '30121', 'Venezia', 20.58),
 (15, 'Davide', 'Ricci', 'M', '1986-07-07', 1.81, 80.5, '20122', 'Milano', 24.57)]

In [60]:
%sql SELECT * FROM occupazione

 * sqlite:///database_prova.db
Done.

[(1, 'Ingegnere', 4000, 'TechSolutions'),
 (2, 'Insegnante', 2500, 'Scuola Statale'),
 (3, 'Medico', 5000, 'Ospedale San Raffaele'),
 (4, 'Architetto', 3800, 'Studio ArchiDesign'),
 (6, 'Commercialista', 3200, 'Finance Group'),
 (7, 'Avvocato', 4500, 'Studio Legale Rossi'),
 (9, 'Programmatore', 3800, 'Software House'),
 (10, 'Designer', 2900, 'Creative Agency'),
 (12, 'Cuoco', 2700, 'Ristorante La Stella'),
 (14, 'Giornalista', 3100, 'Giornale La Notizia')]

In [61]:
# INNER JOIN: solo record che hanno una corrispondenza in entrambe le tabelle
# Ritorna solo quelle persone con id presenti in entrambe le colonne
%%sql
SELECT p.id, p.nome, p.cognome, o.lavoro, o.azienda, o.stipendio
FROM persone p
INNER JOIN occupazione o ON p.id = o.persona_id;

 * sqlite:///database_prova.db
Done.

[(1, 'Luca', 'Rossi', 'Ingegnere', 'TechSolutions', 4000),
 (2, 'Maria', 'Bianchi', 'Insegnante', 'Scuola Statale', 2500),
 (3, 'Giovanni', 'Verdi', 'Medico', 'Ospedale San Raffaele', 5000),
 (4, 'Elena', 'Neri', 'Architetto', 'Studio ArchiDesign', 3800),
 (6, 'Sara', 'Moretti', 'Commercialista', 'Finance Group', 3200),
 (7, 'Alessandro', 'Romano', 'Avvocato', 'Studio Legale Rossi', 4500),
 (9, 'Giorgio', 'Fabbri', 'Programmatore', 'Software House', 3800),
 (10, 'Martina', 'Ferrari', 'Designer', 'Creative Agency', 2900),
 (12, 'Angela', 'Serra', 'Cuoco', 'Ristorante La Stella', 2700),
 (14, 'Silvia', 'Pellegrini', 'Giornalista', 'Giornale La Notizia', 3100)]

In [62]:
# LEFT JOIN: visualizza tutti i record della tabella di sinistra e dove non c'Ã¨ corrispondenza mette None
# Ritorna tutte le persone, alcune non sono nella tabella occupazione, dunque compare None
%%sql
SELECT p.id, p.nome, p.cognome, o.lavoro, o.azienda, o.stipendio
FROM persone p
LEFT JOIN occupazione o ON p.id = o.persona_id;

 * sqlite:///database_prova.db
Done.

[(1, 'Luca', 'Rossi', 'Ingegnere', 'TechSolutions', 4000),
 (2, 'Maria', 'Bianchi', 'Insegnante', 'Scuola Statale', 2500),
 (3, 'Giovanni', 'Verdi', 'Medico', 'Ospedale San Raffaele', 5000),
 (4, 'Elena', 'Neri', 'Architetto', 'Studio ArchiDesign', 3800),
 (5, 'Marco', 'Gallo', None, None, None),
 (6, 'Sara', 'Moretti', 'Commercialista', 'Finance Group', 3200),
 (7, 'Alessandro', 'Romano', 'Avvocato', 'Studio Legale Rossi', 4500),
 (8, 'Francesca', 'De Luca', None, None, None),
 (9, 'Giorgio', 'Fabbri', 'Programmatore', 'Software House', 3800),
 (10, 'Martina', 'Ferrari', 'Designer', 'Creative Agency', 2900),
 (11, 'Paolo', 'Mancini', None, None, None),
 (12, 'Angela', 'Serra', 'Cuoco', 'Ristorante La Stella', 2700),
 (13, 'Fabio', 'Conti', None, None, None),
 (14, 'Silvia', 'Pellegrini', 'Giornalista', 'Giornale La Notizia', 3100),
 (15, 'Davide', 'Ricci', None, None, None)]

In [63]:
# Persone che non hanno un lavoro

%%sql
SELECT p.id, p.nome, p.cognome
FROM persone p
LEFT JOIN occupazione o ON p.id = o.persona_id
WHERE o.lavoro IS NULL;

 * sqlite:///database_prova.db
Done.

[(5, 'Marco', 'Gallo'),
 (8, 'Francesca', 'De Luca'),
 (11, 'Paolo', 'Mancini'),
 (13, 'Fabio', 'Conti'),
 (15, 'Davide', 'Ricci')]

In [64]:
# Chi ha il lavoro piÃ¹ pagato

%%sql
SELECT p.id, p.nome, p.cognome, o.lavoro, o.stipendio
FROM persone p
JOIN occupazione o ON p.id = o.persona_id
WHERE o.stipendio = (SELECT MAX(stipendio) FROM occupazione);

 * sqlite:///database_prova.db
Done.

[(3, 'Giovanni', 'Verdi', 'Medico', 5000)]